In [1]:
import numpy as np
import pandas  as pd
from pandas import Series,DataFrame

In [3]:
ser1=Series(np.arange(4),index=['a','b','c','d'])
ser1=ser1*2
ser1

a    0
b    2
c    4
d    6
dtype: int32

In [5]:
ser1['b']

2

In [6]:
ser1[1]

2

In [7]:
ser1[0:3]

a    0
b    2
c    4
dtype: int32

In [12]:
ser1[['b','d']]

b    2
d    6
dtype: int32

In [13]:
ser1[ser1>3]

c    4
d    6
dtype: int32

In [19]:
ser1[ser1>3]=10

In [20]:
ser1

a     0
b     2
c    10
d    10
dtype: int32

In [21]:
df=DataFrame(np.arange(25).reshape((5,5)),index=['dl','mum','kol','jp','jd'],columns=['A','B','C','D','E'])
df

      A   B   C   D   E
dl    0   1   2   3   4
mum   5   6   7   8   9
kol  10  11  12  13  14
jp   15  16  17  18  19
jd   20  21  22  23  24

In [22]:
df['B']

dl      1
mum     6
kol    11
jp     16
jd     21
Name: B, dtype: int32

In [23]:
df[['B','D','E']]

      B   D   E
dl    1   3   4
mum   6   8   9
kol  11  13  14
jp   16  18  19
jd   21  23  24

In [24]:
df[df['C']>8]

      A   B   C   D   E
kol  10  11  12  13  14
jp   15  16  17  18  19
jd   20  21  22  23  24

In [27]:
df2=df[df['C']<18]
df2

      A   B   C   D   E
dl    0   1   2   3   4
mum   5   6   7   8   9
kol  10  11  12  13  14
jp   15  16  17  18  19

In [26]:
df2[df['C']>6]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

      A   B   C   D   E
mum   5   6   7   8   9
kol  10  11  12  13  14
jp   15  16  17  18  19

In [28]:
df>10

         A      B      C      D      E
dl   False  False  False  False  False
mum  False  False  False  False  False
kol  False   True   True   True   True
jp    True   True   True   True   True
jd    True   True   True   True   True

In [29]:
df.loc['jp']

A    15
B    16
C    17
D    18
E    19
Name: jp, dtype: int32

In [30]:
df.loc[['jp','mum']]

      A   B   C   D   E
jp   15  16  17  18  19
mum   5   6   7   8   9

In [31]:
df.iloc[[3,4]]

     A   B   C   D   E
jp  15  16  17  18  19
jd  20  21  22  23  24

In [35]:
df.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: mum, dtype: int32